EWSEditor/RawEwsExamples/FindItem.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Body>
    <FindItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
              Traversal="Shallow">
      <ItemShape>
        <t:BaseShape>IdOnly</t:BaseShape>
      </ItemShape>
      <IndexedPageItemView MaxEntriesReturned=""<!--FIELD:MaxEntriesReturned;numeric;50-->" Offset="<!--FIELD:Offset;numeric;0-->" BasePoint="<!--FIELD:Basepoint;list;Beginning,End-->" />
      <ParentFolderIds>
        <!--FIELD:Folder;FolderId-->
      </ParentFolderIds>
    </FindItem>
  </soap:Body>
</soap:Envelope>
